OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/adc.c
/**************************************************************************//**
* @file     adc.c
* @version  V1.00
* $Revision: 8 $
* $Date: 15/10/06 9:08a $
* @brief    NUC970 ADC driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "nuc970.h"
#include "sys.h"
#include "adc.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_ADC_Driver ADC Driver
  @{
*/

/** @addtogroup NUC970_ADC_EXPORTED_FUNCTIONS ADC Exported Functions
  @{
*/
/// @cond HIDDEN_SYMBOLS
#define ADC_FIFO_LENGTH 128
volatile int mst_complete;
typedef struct 
{
    ADC_CALLBACK touch_callback;
    UINT32 touch_userData;

    ADC_CALLBACK touchz_callback;
    UINT32 touchz_userData;

    ADC_CALLBACK touch_wakeup_callback;
    UINT32 touch_wakeup_userData;

    ADC_CALLBACK pendown_callback;
    UINT32 pendown_userData;

    ADC_CALLBACK penup_callback;
    UINT32 penup_userData;

    ADC_CALLBACK keypad_conv_callback;
    UINT32 keypad_conv_userData;

    ADC_CALLBACK keypad_press_callback;
    UINT32 keypad_press_userData;

    ADC_CALLBACK keypad_up_callback;
    UINT32 keypad_up_userData;

    ADC_CALLBACK keypad_wakeup_callback;
    UINT32 keypad_wakeup_userData;

    ADC_CALLBACK voltage_battery_callback;
    UINT32 voltage_battery_userData;

    ADC_CALLBACK normal_callback;
    UINT32 normal_userData;
    
    INT16 fifoX[ADC_FIFO_LENGTH];
    INT32 fifoHeadX;
    INT32 fifoTailX;
    INT32 fifoLengthX;

    INT16 fifoY[ADC_FIFO_LENGTH];
    INT32 fifoHeadY;
    INT32 fifoTailY;
    INT32 fifoLengthY;

    INT16 fifoZ1[ADC_FIFO_LENGTH];
    INT32 fifoHeadZ1;
    INT32 fifoTailZ1;
    INT32 fifoLengthZ1;

    INT16 fifoZ2[ADC_FIFO_LENGTH];
    INT32 fifoHeadZ2;
    INT32 fifoTailZ2;
    INT32 fifoLengthZ2;
} ADC_HANDLE;
/// @endcond HIDDEN_SYMBOLS 

static ADC_HANDLE adcHandler;

void adcISR(void);


/**
 * @brief       Open ADC Function.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to open adc function.
 */
INT adcOpen(void)
{
  return adcOpen2(1000);
}

/**
 * @brief       Open ADC2 Function.
 *
 * @param[in]   freqKhz  The ADC engine clock. It should be 1000Khz~3000Khz
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to open adc function.
 */
INT adcOpen2(uint32_t freqKhz)
{
     uint32_t div;
    /* Enable ADC engine clock */
    outpw(REG_CLK_PCLKEN1, 1<<24);

    /* Reset the ADC IP */
    outpw(REG_SYS_APBIPRST1, (1<<24));
    outpw(REG_SYS_APBIPRST1, 0);

    /* ADC Engine Clock is set to freq Khz */
    if(freqKhz>3000) freqKhz=3000;
    if(freqKhz<1000) freqKhz=1000;
    div=12000/freqKhz;
    outpw(REG_CLK_DIVCTL7, inpw(REG_CLK_DIVCTL7) & ~((0x3<<19)|(0x7<<16)|(0xFFul<<24)));
    outpw(REG_CLK_DIVCTL7, (0<<19)|(0<<16)|((div-1)<<24));

    /* Enable ADC Power */
    outpw(REG_ADC_CTL, ADC_CTL_ADEN);

    /* Enable ADC to high speed mode */
    outpw(REG_ADC_CONF, inpw(REG_ADC_CONF)|ADC_CONF_HSPEED);

    /* Set interrupt */   
    sysSetInterruptType(ADC_IRQn, HIGH_LEVEL_SENSITIVE);
    sysInstallISR(IRQ_LEVEL_7, ADC_IRQn, (PVOID)adcISR);
    sysSetLocalInterrupt(ENABLE_IRQ);                            /* enable CPSR I bit */
    sysEnableInterrupt(ADC_IRQn);

    /* Init the FIFO buffer */
    adcHandler.fifoHeadX = 0;
    adcHandler.fifoTailX = 0;
    adcHandler.fifoLengthX = 0;
    adcHandler.fifoHeadY = 0;
    adcHandler.fifoTailY = 0;
    adcHandler.fifoLengthY = 0;
    adcHandler.fifoHeadZ1 = 0;
    adcHandler.fifoTailZ1 = 0;
    adcHandler.fifoLengthZ1 = 0;
    adcHandler.fifoHeadZ2 = 0;
    adcHandler.fifoTailZ2 = 0;
    adcHandler.fifoLengthZ2 = 0;

    adcHandler.touch_callback=NULL;
    adcHandler.touch_userData=NULL;

    adcHandler.touchz_callback=NULL;
    adcHandler.touchz_userData=NULL;

    adcHandler.pendown_callback=NULL;
    adcHandler.pendown_userData=NULL;

    adcHandler.penup_callback=NULL;
    adcHandler.penup_userData=NULL;

    adcHandler.keypad_conv_callback=NULL;
    adcHandler.keypad_conv_userData=NULL;

    adcHandler.keypad_press_callback=NULL;
    adcHandler.keypad_press_userData=NULL;

    adcHandler.keypad_up_callback=NULL;
    adcHandler.keypad_up_userData=NULL;

    adcHandler.voltage_battery_callback=NULL;
    adcHandler.voltage_battery_userData=NULL;

    adcHandler.normal_callback=NULL;
    adcHandler.normal_userData=NULL;

    return Successful;
}

/**
 * @brief       Close ADC Function.
 *
 * @retval      <0              Fail
 * @retval      0               Success
 *
 * @details     This function is used to close adc function.
 */
int adcClose(void)
{
    /* Disable interrupt */   
    sysDisableInterrupt(ADC_IRQn);
    sysSetLocalInterrupt(DISABLE_IRQ);   /* Disable CPSR I bit */

    /* Disable ADC Power */
    outpw(REG_ADC_CTL, inpw(REG_ADC_CTL) & ~ADC_CTL_ADEN);

    /* Disable ADC engine clock */
    outpw(REG_CLK_PCLKEN1, inpw(REG_CLK_PCLKEN1) & ~(1<<24));

    return Successful;
}

/**
 * @brief       The read touch xy data of ADC.
 *
 * @param[out]  bufX     Data buffer for x-position data
 * @param[out]  bufY     Data buffer for y-position data
 * @param[in]   dataCnt  The length of ADC x- and y-position data from FIFO
 *
 * @return      Data count actually
 *
 * @details     This function is used to read touch x-position data and touch y-position data .
 */
INT adcReadXY(INT16 *bufX, INT16 *bufY,int dataCnt)
{
    INT32 i;
    volatile INT16 *fifoX, *fifoY;
    volatile INT32 headX, headY;
    volatile INT32 fifoLengthX, readLengthX;
    volatile INT32 fifoLengthY, readLengthY;

    fifoX = adcHandler.fifoX;
    fifoY = adcHandler.fifoY;
    headX = adcHandler.fifoHeadX;
    headY = adcHandler.fifoHeadY;
    fifoLengthX = adcHandler.fifoLengthX;
    fifoLengthY = adcHandler.fifoLengthY;    
   
    readLengthX = 0;
    readLengthY = 0;
    
    for (i = 0; i < dataCnt; i++)
    {
        if (fifoLengthX > readLengthX)
        {
           bufX[i] = fifoX[headX];
           readLengthX++;
           headX++;
           if (headX >= ADC_FIFO_LENGTH)
           {
              headX = 0;
           }
        }
        else
        {
           /* FIFO is empty, just return */
           break;
        }
    }
    
    for (i = 0; i < dataCnt; i++)
    {
        if (fifoLengthY > readLengthY)
        {
           bufY[i] = fifoY[headY];
           readLengthY++;
           headY++;
           if (headY >= ADC_FIFO_LENGTH)
           {
              headY = 0;
           }
        }
        else
        {
           /* FIFO is empty, just return */
           break;
        }     
    }
        
