OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/adc.c
    /* Update FIFO information */
    adcHandler.fifoHeadX = headX;
    adcHandler.fifoLengthX -= readLengthX;
    adcHandler.fifoHeadY = headY;
    adcHandler.fifoLengthY -= readLengthY;    
    return i;
}

/**
 * @brief       The read touch z data of ADC.
 *
 * @param[out]  bufZ1    Data buffer for pressure measure Z1 data
 * @param[out]  bufZ2    Data buffer for pressure measure Z2 data
 * @param[in]   dataCnt  The length of ADC x- and y-position data from FIFO
 *
 * @return      Data count actually
 *
 * @details     This function is used to read touch pressure measure Z1 data and touch pressure measure Z2 data .
 */
int adcReadZ(short *bufZ1, short *bufZ2, int dataCnt)
{
    INT32 i;
    volatile INT16 *fifoZ1, *fifoZ2;
    volatile INT32 headZ1, headZ2;
    volatile INT32 fifoLengthZ1, readLengthZ1;
    volatile INT32 fifoLengthZ2, readLengthZ2;

    fifoZ1 = adcHandler.fifoZ1;
    fifoZ2 = adcHandler.fifoZ2;
    headZ1 = adcHandler.fifoHeadZ1;
    headZ2 = adcHandler.fifoHeadZ2;
    fifoLengthZ1 = adcHandler.fifoLengthZ1;
    fifoLengthZ2 = adcHandler.fifoLengthZ2;    
   
    readLengthZ1 = 0;
    readLengthZ2 = 0;
    
    for (i = 0; i < dataCnt; i++)
    {
        if (fifoLengthZ1 > readLengthZ1)
        {
           bufZ1[i] = fifoZ1[headZ1];
           readLengthZ1++;
           headZ1++;
           if (headZ1 >= ADC_FIFO_LENGTH)
           {
              headZ1 = 0;
           }
        }
        else
        {
           /* FIFO is empty, just return */
           break;
        }
    }
    
    for (i = 0; i < dataCnt; i++)
    {
        if (fifoLengthZ2 > readLengthZ2)
        {
           bufZ2[i] = fifoZ2[headZ2];
           readLengthZ2++;
           headZ2++;
           if (headZ2 >= ADC_FIFO_LENGTH)
           {
              headZ2 = 0;
           }
        }
        else
        {
           /* FIFO is empty, just return */
           break;
        }     
    }
        
    /* Update FIFO information */
    adcHandler.fifoHeadZ1 = headZ1;
    adcHandler.fifoLengthZ1 -= readLengthZ1;
    adcHandler.fifoHeadZ2 = headZ2;
    adcHandler.fifoLengthZ2 -= readLengthZ2;    
    return i;
}

/**
 * @brief       The ioctl function of ADC device library.
 *
 * @param[in]   cmd   The command of adcIoctl function
 * @param[in]   arg1  The first argument of adcIoctl function
 * @param[in]   arg2  The second argument of adcIoctl function
 *
 * @retval      <0              Wrong command of adcIoctl
 * @retval      0               Success
 *
 * @details     This function is used to ioctl of ADC device library.
 *              Valid parameter combinations listed in following table:
 * |cmd                   |arg1                               |arg2                         |
 * | :---------------------| :-------------------------------  | :-------------------------  |
 * |\ref START_MST        | NULL                              | NULL                        |
 * |\ref START_MST_POLLING | NULL                              | NULL                        |
 * |\ref VBPOWER_ON       | NULL                              | NULL                        |
 * |\ref VBPOWER_OFF      | NULL                              | NULL                        |
 * |\ref VBAT_ON          | Callback function                 | UserData                    |
 * |\ref VBAT_OFF         | NULL                              | NULL                        |
 * |\ref KPPOWER_ON       | NULL                              | NULL                        |
 * |\ref KPPOWER_OFF      | NULL                              | NULL                        |
 * |\ref KPCONV_ON        | Callback function                 | UserData                    |
 * |\ref KPCONV_OFF       | NULL                              | NULL                        |
 * |\ref KPPRESS_ON       | Callback function                 | UserData                    |
 * |\ref KPPRESS_OFF      | NULL                              | NULL                        |
 * |\ref KPUP_ON          | Callback function                 | UserData                    |
 * |\ref KPUP_OFF         | NULL                              | NULL                        |
 * |\ref PEPOWER_ON       | NULL                              | NULL                        |
 * |\ref PEPOWER_OFF      | NULL                              | NULL                        |
 * |\ref PEDEF_ON         | Callback function                 | UserData                    |
 * |\ref PEDEF_OFF        | NULL                              | NULL                        |
 * |\ref WKP_ON           | NULL                              | NULL                        |
 * |\ref WKP_OFF          | NULL                              | NULL                        |
 * |\ref WKT_ON           | NULL                              | NULL                        |
 * |\ref WKT_OFF          | NULL                              | NULL                        |
 * |\ref SWITCH_5WIRE_ON  | NULL                              | NULL                        |
 * |\ref SWITCH_5WIRE_OFF | NULL                              | NULL                        |
 * |\ref T_ON             | Callback function                 | UserData                    |
 * |\ref T_OFF            | NULL                              | NULL                        |
 * |\ref TAVG_ON          | NULL                              | NULL                        |
 * |\ref TAVG_OFF         | NULL                              | NULL                        |
 * |\ref Z_ON             | Callback function                 | UserData                    |
 * |\ref Z_OFF            | NULL                              | NULL                        |
 * |\ref TZAVG_ON         | NULL                              | NULL                        |
 * |\ref TZAVG_OFF        | NULL                              | NULL                        |
 * |\ref NAC_ON           | Callback function                 | UserData                    |
 * |\ref NAC_OFF          | NULL                              | NULL                        |
 */
INT adcIoctl(ADC_CMD cmd, INT32 arg1, INT32 arg2)
{
    UINT32 reg;
    switch(cmd)
    {
       case START_MST:             //Menu Start Conversion
       {
          mst_complete=0;
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_MIEN;
          outpw(REG_ADC_IER, reg);
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_MST;
          outpw(REG_ADC_CTL, reg);
          while(!mst_complete);
       }
       break;
       case START_MST_POLLING:             //Menu Start Conversion
       {
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_MIEN;
          outpw(REG_ADC_IER, reg);
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_MST;
          outpw(REG_ADC_CTL, reg);
          while((inpw(REG_ADC_ISR)&ADC_ISR_MF)==0);
          adcISR();
       }
       break;			 
       case VBPOWER_ON:           //Enable ADC Internal Bandgap Power 
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_VBGEN;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case VBPOWER_OFF:          //Disable ADC Internal Bandgap Power 
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_VBGEN;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case KPPOWER_ON:          //Enable ADC Keypad Power
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_PWKPEN;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case KPPOWER_OFF:         //Disable ADC Keypad Power
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_PWKPEN;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case PEPOWER_ON:          //Enable Pen Power
       {
          UINT32 treg;
          treg = inpw(REG_ADC_IER);
          outpw(REG_ADC_IER, treg & ~(ADC_IER_PEDEIEN | ADC_IER_PEUEIEN));

