OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/adc.c
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_PEDEEN;
          outpw(REG_ADC_CTL, reg);
         
         do{
          reg = (ADC_ISR_PEDEF | ADC_ISR_PEUEF);
          outpw(REG_ADC_ISR, reg);
         }while(inpw(REG_ADC_ISR)&(ADC_ISR_PEDEF | ADC_ISR_PEUEF));

          outpw(REG_ADC_IER,treg);
       }
       break;
       case PEPOWER_OFF:         //Disable Pen Power
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_PEDEEN;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case KPPRESS_ON:         //Enable Keypad press event
       {
          ADC_CALLBACK keypad_press_callback;
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_KPEIEN;
          outpw(REG_ADC_IER, reg);
          keypad_press_callback = (ADC_CALLBACK) arg1;
          if (keypad_press_callback != NULL )
          {
             adcHandler.keypad_press_callback = keypad_press_callback;
             adcHandler.keypad_press_userData = (UINT32)arg2;
          }
       }
       break;
       case KPPRESS_OFF:        //Disable Keypad press event
       {
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_KPEIEN;
          outpw(REG_ADC_IER, reg);
          adcHandler.keypad_press_callback = NULL;
          adcHandler.keypad_press_userData = NULL;
       }
       break;
       case KPUP_ON:           //Enable Keypad up event
       {
          ADC_CALLBACK keypad_up_callback;
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_KPUEIEN;
          outpw(REG_ADC_IER, reg);
          keypad_up_callback = (ADC_CALLBACK) arg1;
          if (keypad_up_callback != NULL )
          {
             adcHandler.keypad_up_callback = keypad_up_callback;
             adcHandler.keypad_up_userData = (UINT32)arg2;
          }
       }
       break;
       case KPUP_OFF:         //Disable Keypad up event
       {
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_KPUEIEN;
          outpw(REG_ADC_IER, reg);
          adcHandler.keypad_up_callback = NULL;
          adcHandler.keypad_up_userData = NULL;
       }
       break;
       case PEDEF_ON:          //Enable Pen Down Event
       {
          ADC_CALLBACK pendown_callback;
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_PEDEIEN;
          outpw(REG_ADC_IER, reg);
          pendown_callback = (ADC_CALLBACK) arg1;
          if (pendown_callback != NULL )
          {
             adcHandler.pendown_callback = pendown_callback;
             adcHandler.pendown_userData = (UINT32)arg2;
          }
       }
       break;
       case PEDEF_OFF:         //Disable Pen Down Event
       {
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_PEDEIEN;
          outpw(REG_ADC_IER, reg);
          adcHandler.pendown_callback = NULL;
          adcHandler.pendown_userData = NULL;
       }
       break;
       case WKP_ON:           //Enable Keypad Press Wake Up
       {
          ADC_CALLBACK keypad_wakeup_callback;
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_WKPEN;
          outpw(REG_ADC_CTL, reg);
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_WKPIEN;
          outpw(REG_ADC_IER, reg);
          reg=inpw(REG_SYS_WKUPSER);
          reg = reg | (1<<26); //Enable ADC Wake System Up.
          outpw(REG_SYS_WKUPSER,reg);
          keypad_wakeup_callback = (ADC_CALLBACK) arg1;
          if (keypad_wakeup_callback != NULL )
          {
             adcHandler.keypad_wakeup_callback = keypad_wakeup_callback;
             adcHandler.keypad_wakeup_userData = (UINT32)arg2;
          }
       }
       break;
       case WKP_OFF:          //Disable Keypad Press Wake Up
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_WKPEN;
          outpw(REG_ADC_CTL, reg);
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_WKPIEN;
          outpw(REG_ADC_IER, reg);
          reg=inpw(REG_SYS_WKUPSER);
          reg = reg & ~(1<<26); //Enable ADC Wake System Up.
          outpw(REG_SYS_WKUPSER,reg);
          adcHandler.keypad_wakeup_callback = NULL;
          adcHandler.keypad_wakeup_userData = NULL;
       }
       break;
       case WKT_ON:           //Enable Touch Wake Up
       {
          ADC_CALLBACK touch_wakeup_callback;
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_WKTEN;
          outpw(REG_ADC_CTL, reg);
          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_WKTIEN;
          outpw(REG_ADC_IER, reg);
          reg=inpw(REG_SYS_WKUPSER);
          reg = reg | (1<<26); //Enable ADC Wake System Up.
          outpw(REG_SYS_WKUPSER,reg);
          touch_wakeup_callback = (ADC_CALLBACK) arg1;
          if (touch_wakeup_callback != NULL )
          {
             adcHandler.touch_wakeup_callback = touch_wakeup_callback;
             adcHandler.touch_wakeup_userData = (UINT32)arg2;
          }
       }
       break;
       case WKT_OFF:          //Disable Touch Wake Up
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_WKTEN;
          outpw(REG_ADC_CTL, reg);
          reg = inpw(REG_ADC_IER);
          reg = reg & ~ADC_IER_WKTIEN;
          outpw(REG_ADC_IER, reg);
          adcHandler.touch_wakeup_callback = NULL;
          adcHandler.touch_wakeup_userData = NULL;
       }
       break;
       case SWITCH_5WIRE_ON:  //Wire Mode Switch to 5-Wire
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg | ADC_CTL_WMSWCH;
          outpw(REG_ADC_CTL, reg);
       }
       break;
       case SWITCH_5WIRE_OFF: //Wire Mode Switch to 4-Wire
       {
          reg = inpw(REG_ADC_CTL);
          reg = reg & ~ADC_CTL_WMSWCH;
          outpw(REG_ADC_CTL, reg);
       }
       break;

       case T_ON: //Enable Touch detection function
       {
          ADC_CALLBACK touch_callback;
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_TEN;
          outpw(REG_ADC_CONF, reg);
          touch_callback = (ADC_CALLBACK) arg1;
          if (touch_callback != NULL )
          {
             adcHandler.touch_callback = touch_callback;
             adcHandler.touch_userData = (UINT32)arg2;
          }
          /* Flush the FIFO */
          adcHandler.fifoHeadX = 0;
          adcHandler.fifoTailX = 0;
          adcHandler.fifoLengthX = 0;
          adcHandler.fifoHeadY = 0;
          adcHandler.fifoTailY = 0;
          adcHandler.fifoLengthY = 0;
       }
       break;
       case T_OFF: //Disable Touch detection function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_TEN;
          outpw(REG_ADC_CONF, reg);
          adcHandler.touch_callback = NULL;
          adcHandler.touch_userData = NULL;
       }
       break;
       case TAVG_ON: //Enable Touch Mean average for X and Y function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_DISTMAVEN;
          outpw(REG_ADC_CONF, reg);
       }
       break;
       case TAVG_OFF: //Disable Touch Mean average for X and Y function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_DISTMAVEN;
          outpw(REG_ADC_CONF, reg);
       }
       break;
       case Z_ON: //Enable Press measure function
       {
          ADC_CALLBACK touchz_callback;
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_ZEN;
          outpw(REG_ADC_CONF, reg);
          touchz_callback = (ADC_CALLBACK) arg1;
          if (touchz_callback != NULL )
          {
             adcHandler.touchz_callback = touchz_callback;
             adcHandler.touchz_userData = (UINT32)arg2;
          }
          /* Flush the FIFO */
          adcHandler.fifoHeadZ1 = 0;
          adcHandler.fifoTailZ1 = 0;
          adcHandler.fifoLengthZ1 = 0;
          adcHandler.fifoHeadZ2 = 0;
          adcHandler.fifoTailZ2 = 0;
          adcHandler.fifoLengthZ2 = 0;
       }
       break;
       case Z_OFF: //Disable Press measure function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_ZEN;
          outpw(REG_ADC_CONF, reg);
       }
       break;
       case TZAVG_ON: //Enable Pressure Mean average for Z1 and Z2 function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_DISZMAVEN;
          outpw(REG_ADC_CONF, reg);
       }
       break;
       case TZAVG_OFF: //Disable Pressure Mean average for Z1 and Z2 function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_DISZMAVEN;
          outpw(REG_ADC_CONF, reg);
       }
       break;
       case NAC_ON: //Enable Normal AD Conversion
       {
          ADC_CALLBACK normal_callback;
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_NACEN | ADC_CONF_REFSEL_AVDD33;
          outpw(REG_ADC_CONF, reg);
          normal_callback = (ADC_CALLBACK) arg1;
          if (normal_callback != NULL )
          {
             adcHandler.normal_callback = normal_callback;
             adcHandler.normal_userData = (UINT32)arg2;
          }
       }
       break;
       case NAC_OFF: //Disable Normal AD Conversion
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_NACEN;
          outpw(REG_ADC_CONF, reg);
          adcHandler.normal_callback = NULL;
          adcHandler.normal_userData = NULL;
       }
       break;
       case VBAT_ON: //Enable Voltage Battery Conversion
       {
          ADC_CALLBACK voltage_battery_callback;
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_VBATEN;
          outpw(REG_ADC_CONF, reg);
          voltage_battery_callback = (ADC_CALLBACK) arg1;
          if (voltage_battery_callback != NULL )
          {
             adcHandler.voltage_battery_callback = voltage_battery_callback;
             adcHandler.voltage_battery_userData = (UINT32)arg2;
          }
       }
       break;
       case VBAT_OFF: //Disable Voltage Battery
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_VBATEN;
          outpw(REG_ADC_CONF, reg);
          adcHandler.voltage_battery_callback = NULL;
          adcHandler.voltage_battery_userData = NULL;
       }
       break;
       case KPCONV_ON: //Enable Keypad conversion function
       {
          ADC_CALLBACK keypad_conv_callback;
          reg = inpw(REG_ADC_CONF);
          reg = reg | ADC_CONF_KPCEN;
          outpw(REG_ADC_CONF, reg);

          reg = inpw(REG_ADC_IER);
          reg = reg | ADC_IER_KPEIEN;
          outpw(REG_ADC_IER, reg);

          keypad_conv_callback = (ADC_CALLBACK) arg1;
          if (keypad_conv_callback != NULL )
          {
             adcHandler.keypad_conv_callback = keypad_conv_callback;
             adcHandler.keypad_conv_userData = (UINT32)arg2;
          }
       }
       break;
       case KPCONV_OFF: //Disable Keypad conversion function
       {
          reg = inpw(REG_ADC_CONF);
          reg = reg & ~ADC_CONF_KPCEN;
          outpw(REG_ADC_CONF, reg);
          adcHandler.keypad_conv_callback = NULL;
          adcHandler.keypad_conv_userData = NULL;
       }
       break;
       default:
          return ADC_ERR_CMD;
    }
    return Successful;
}

/// @cond HIDDEN_SYMBOLS
#if 0
#define DbgPrintf sysprintf
#else
#define DbgPrintf(...)
#endif
/// @endcond HIDDEN_SYMBOLS 
/**
 * @brief       The interrupt service routines of ADC
 * @return      None
 * @details     This function is used to ADC interrupt handler.
 */
void adcISR(void)
{
  unsigned int isr,ier,wkisr,conf;
  conf=inpw(REG_ADC_CONF);
  isr=inpw(REG_ADC_ISR);
  ier=inpw(REG_ADC_IER);
  wkisr=inpw(REG_ADC_WKISR);
  //sysprintf("ADC_IRQHandler Interrupt(0x%08x): ",isr); 
  DbgPrintf("REG_ADC_CTL=0x%08x\n",inpw(REG_ADC_CTL));
  DbgPrintf("REG_ADC_IER=0x%08x\n",inpw(REG_ADC_IER));
  DbgPrintf("REG_ADC_ISR=0x%08x\n",inpw(REG_ADC_ISR));
  DbgPrintf("REG_ADC_WKISR=0x%08x\n",inpw(REG_ADC_WKISR));
  DbgPrintf("SYS_WKUPSSR=0x%08x\n",inpw(REG_SYS_WKUPSSR));
  DbgPrintf("SYS_WKUPSER=0x%08x\n",inpw(REG_SYS_WKUPSER));
  if(isr & ADC_ISR_SELFTF)
  {
    outpw(REG_ADC_ISR,ADC_ISR_SELFTF);
    DbgPrintf("menu self-test complete\n");
  }

