OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/adc.c
  if(isr & ADC_ISR_TF)
  {
    unsigned int value;
    INT32 tailX, lengthX;
    INT32 tailY, lengthY;
    INT16 *fifoX, *fifoY;
    tailX   = adcHandler.fifoTailX;
    lengthX = adcHandler.fifoLengthX;
    tailY   = adcHandler.fifoTailY;
    lengthY = adcHandler.fifoLengthY;
    fifoX  = adcHandler.fifoX;
    fifoY  = adcHandler.fifoY;
    outpw(REG_ADC_ISR,ADC_ISR_TF); //Clear TF flags
    value = inpw(REG_ADC_XYDATA);
    if(adcHandler.touch_callback!=NULL)
       adcHandler.touch_callback(value, adcHandler.touch_userData);

    if ( (lengthX<ADC_FIFO_LENGTH) && (lengthY<ADC_FIFO_LENGTH))
    {
       fifoX[tailX] = value & 0xFFF;
       lengthX++;
       tailX++;
       if (tailX == ADC_FIFO_LENGTH) tailX = 0;

       fifoY[tailY] = (value >>16) & 0xFFF;
       lengthY++;
       tailY++;
       if (tailY == ADC_FIFO_LENGTH) tailY = 0;
    }
    /* Update FIFO status */
    adcHandler.fifoTailX = tailX;
    adcHandler.fifoLengthX = lengthX;
    adcHandler.fifoTailY = tailY;
    adcHandler.fifoLengthY = lengthY;
    DbgPrintf("touch detect complete\n");
  }

  if((isr & ADC_ISR_KPEF) && (ier & ADC_IER_KPEIEN))
  {
    outpw(REG_ADC_ISR,ADC_ISR_KPEF);
    if(adcHandler.keypad_press_callback!=NULL)
       adcHandler.keypad_press_callback(1, adcHandler.keypad_press_userData);
    DbgPrintf("key press complete\n");
  }

  if((isr & ADC_ISR_ZF) && (conf & ADC_CONF_ZEN))
  {
    unsigned int value;
    volatile INT32 tailZ1, lengthZ1;
    volatile INT32 tailZ2, lengthZ2;
    volatile INT16 *fifoZ1, *fifoZ2;
    tailZ1   = adcHandler.fifoTailZ1;
    lengthZ1 = adcHandler.fifoLengthZ1;
    tailZ2   = adcHandler.fifoTailZ2;
    lengthZ2 = adcHandler.fifoLengthZ2;

    fifoZ1  = adcHandler.fifoZ1;
    fifoZ2  = adcHandler.fifoZ2;
    outpw(REG_ADC_ISR,ADC_ISR_ZF); //clear TF flags
    value = inpw(REG_ADC_ZDATA);
    if(adcHandler.touchz_callback!=NULL)
       adcHandler.touchz_callback(value, adcHandler.touchz_userData);
    if ( (lengthZ1<ADC_FIFO_LENGTH) && (lengthZ2<ADC_FIFO_LENGTH))
    {
       fifoZ1[tailZ1] = value & 0xFFF;
       lengthZ1++;
       tailZ1++;
       if (tailZ1 == ADC_FIFO_LENGTH) tailZ1 = 0;

       fifoZ2[tailZ2] = (value >>16) & 0xFFF;
       lengthZ2++;
       tailZ2++;
       if (tailZ2 == ADC_FIFO_LENGTH) tailZ2 = 0;
    }
    /* Update FIFO status */
    adcHandler.fifoTailZ1 = tailZ1;
    adcHandler.fifoLengthZ1 = lengthZ1;
    adcHandler.fifoTailZ2 = tailZ2;
    adcHandler.fifoLengthZ2 = lengthZ2;
    DbgPrintf("z conversion complete\n");
  }

  if((isr & ADC_ISR_NACF) && (conf & ADC_CONF_NACEN))
  {
    outpw(REG_ADC_ISR,ADC_ISR_NACF);
    if(adcHandler.normal_callback!=NULL)
       adcHandler.normal_callback(inpw(REG_ADC_DATA), adcHandler.normal_userData);
    DbgPrintf("normal AD conversion complete\n");
  }

  if((isr & ADC_ISR_VBF) && (conf & ADC_CONF_VBATEN))
  {
    if(adcHandler.voltage_battery_callback!=NULL)
       adcHandler.voltage_battery_callback(inpw(REG_ADC_VBADATA), adcHandler.voltage_battery_userData);
    outpw(REG_ADC_ISR,ADC_ISR_VBF);
    DbgPrintf("bettery volage complete\n");
  }

  if((isr & ADC_ISR_KPCF)&& (conf & ADC_CONF_KPCEN))
  {
    unsigned int value;
    outpw(REG_ADC_ISR,ADC_ISR_KPCF);
    value=inpw(REG_ADC_KPDATA);
    if(adcHandler.keypad_conv_callback!=NULL)
       adcHandler.keypad_conv_callback(value, adcHandler.keypad_conv_userData);
    DbgPrintf("Menu Keypad Press Conversion Finish\n");
  }

  if((isr & ADC_ISR_KPUEF) && (ier & ADC_IER_KPUEIEN))
  {
    outpw(REG_ADC_ISR,ADC_ISR_KPUEF);
    if(adcHandler.keypad_up_callback!=NULL)
       adcHandler.keypad_up_callback(0, adcHandler.keypad_press_userData);
    DbgPrintf("keypad up\n");
  }
  
  if((isr & ADC_ISR_PEUEF) && (ier & ADC_IER_PEUEIEN))
  {
    outpw(REG_ADC_ISR,ADC_ISR_PEUEF | ADC_ISR_PEDEF);
    DbgPrintf("menu pen up complete\n");
  }else if((isr & ADC_ISR_PEDEF) && (isr & ADC_IER_PEDEIEN))
  {
    if(adcHandler.pendown_callback!=NULL)
      adcHandler.pendown_callback(isr, adcHandler.pendown_userData);
    outpw(REG_ADC_ISR,ADC_ISR_PEUEF | ADC_ISR_PEDEF);
    DbgPrintf("pen down complete\n");
  }
  
  if(isr & ADC_ISR_MF)
  {
    outpw(REG_ADC_ISR,ADC_ISR_MF);
    mst_complete=1;
    DbgPrintf("menu complete\n");
  }
  
  if((wkisr & ADC_WKISR_WKPEF) && (ier & ADC_IER_WKPIEN))
  {
    if(adcHandler.keypad_wakeup_callback!=NULL)
      adcHandler.keypad_wakeup_callback(wkisr, adcHandler.keypad_wakeup_userData);
    outpw(REG_ADC_WKISR,ADC_WKISR_WKPEF);

    if(inpw(REG_SYS_WKUPSSR) & (1<<26))
      outpw(REG_SYS_WKUPSSR,(1<<26));
    DbgPrintf("key press event wakeup\n");
  }
  
  if((wkisr & ADC_WKISR_WPEDEF) && (ier & ADC_IER_WKTIEN) )
  {
   if(adcHandler.touch_wakeup_callback!=NULL)
      adcHandler.touch_wakeup_callback(wkisr, adcHandler.touch_wakeup_userData);
   outpw(REG_ADC_WKISR,ADC_WKISR_WPEDEF);
   if(inpw(REG_SYS_WKUPSSR) & (1<<26))
      outpw(REG_SYS_WKUPSSR,(1<<26));
    DbgPrintf("pen down event wakeup\n");
  }
}

/**
 * @brief       The ChangeChannel function of ADC device library
 *
 * @param       channel    Select ADC input for normal mode.Including:
 *                         - \ref AIN0
 *                         - \ref AIN1
 *                         - \ref AIN2
 *                         - \ref AIN3
 *                         - \ref AIN4
 *                         - \ref AIN5
 *                         - \ref AIN6
 *                         - \ref AIN7
 *
 * @retval      <0         Wrong argument
 * @retval      0          Success
 *
 * @details     This function is used to set channel for normal mode.
 */
INT adcChangeChannel(int channel)
{
    UINT32 reg;
    if ((channel>>3) < 0 || (channel>>3) > 7)
    {
       return ADC_ERR_ARGS;
    }
    reg = inpw(REG_ADC_CONF);
    reg = (reg & ~ADC_CONF_CHSEL_Msk) | channel;
    outpw(REG_ADC_CONF,reg);
    return Successful;
}

/*@}*/ /* end of group NUC970_ADC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_ADC_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
